/*global document*/
/*global confirm*/
/*global console*/
/* eslint no-console: 0*/
/*jslint plusplus: true */
/*global alert*/
/*jslint evil: true */


/*
بتخلي الصفحة تتعرف علي يعني غيرت لون الموقع مثلا الى الازرق بتتخزن عندي ال cookies ال
cookies في الجهاز وبتخلي الصفحة تتعرف عليا لو سكرت الصفحة وفتحتها مرة ثانية ال cookies
بتروح بتجيبلي الإعدادات الي انا اخترتها هاي فكرة الكوكيز

date الكوكيز الها تاريخ صلاحة وبعدين بتنتهي بتعتمد على ال
الجافا سكريبت ممكن تكريت او تعدل او تحذف الكوكيز
*/

//هاي بتقرا الكوكيز
document.cookie;


//بدنا نعمل كوكيز
/*
document.cookie("name=value; expires=Date; path=");

name=value   peer to peer
color=blue

expires=Date :  string بيطلب مني التاريخ بطريقة ال
لو ماكتبت التاريخ لحد ما يقفل الصحة بينشال الكوكيز ول كتبتو لحد شهر مثلا بنشال اما بعد شهر
او لحتى هو يحذفو

path: path بدك اياه يمشي على الدومين للموقع كلو ولا بس على الصفحة لو ماكتبت ال
رح يتعامل مع الكوكيز في الصفحة الي انا فيها بس يعني الاعدادات الي اخترتها في الكوكيز
رح تتطبق بالصفحة هاي بس لو رحت على صفحة ثانية مارح تعرفني بس هاي الصفحة عارفيتني
رح يعملي الكوكيز بكل الموقع تبعي path اما لو كتبت ال
*/
document.cookie("color=blue");
document.cookie;
